In [63]:
import pyodbc
import pandas as pd

In [65]:
cnxn_str = ("Driver={SQL Server Native Client 11.0};"
            "Server=DESKTOP-DPJBSNT;"
            "Database=AdventureWorks2019;"
            "Trusted_Connection=yes;"
            "UID=kanchanc;"
            "PWD=StudyItIs@2108;")

def HandleHierarchyId(v):
      return str(v)

In [66]:
cnxn = pyodbc.connect(cnxn_str)
cnxn.add_output_converter(-151, HandleHierarchyId)
print("connection established successfully! :)")

connection established successfully! :)

In [68]:
#creating the cursor to execute sql queries
cursor = cnxn.cursor()
query= "select TOP 10 * from HumanResources.Employee"

In [69]:
cursor.execute(query).fetchall()

[(1, '295847284', 'adventure-works\\ken0', None, None, 'Chief Executive Officer', datetime.date(1969, 1, 29), 'S', 'M', datetime.date(2009, 1, 14), True, 99, 69, True, 'F01251E5-96A3-448D-981E-0F99D789110D', datetime.datetime(2014, 6, 30, 0, 0)),
 (2, '245797967', 'adventure-works\\terri0', "b'X'", 1, 'Vice President of Engineering', datetime.date(1971, 8, 1), 'S', 'F', datetime.date(2008, 1, 31), True, 1, 20, True, '45E8F437-670D-4409-93CB-F9424A40D6EE', datetime.datetime(2014, 6, 30, 0, 0)),
 (3, '509647174', 'adventure-works\\roberto0', "b'Z\\xc0'", 2, 'Engineering Manager', datetime.date(1974, 11, 12), 'M', 'M', datetime.date(2007, 11, 11), True, 2, 21, True, '9BBBFB2C-EFBB-4217-9AB7-F97689328841', datetime.datetime(2014, 6, 30, 0, 0)),
 (4, '112457891', 'adventure-works\\rob0', "b'Z\\xd6'", 3, 'Senior Tool Designer', datetime.date(1974, 12, 23), 'S', 'M', datetime.date(2007, 12, 5), False, 48, 80, True, '59747955-87B8-443F-8ED4-F8AD3AFDF3A9', datetime.datetime(2014, 6, 30, 0, 0)),
 (5, '695256908', 'adventure-works\\gail0', "b'Z\\xda'", 3, 'Design Engineer', datetime.date(1952, 9, 27), 'M', 'F', datetime.date(2008, 1, 6), True, 5, 22, True, 'EC84AE09-F9B8-4A15-B4A9-6CCBAB919B08', datetime.datetime(2014, 6, 30, 0, 0)),
 (6, '998320692', 'adventure-works\\jossef0', "b'Z\\xde'", 3, 'Design Engineer', datetime.date(1959, 3, 11), 'M', 'M', datetime.date(2008, 1, 24), True, 6, 23, True, 'E39056F1-9CD5-478D-8945-14ACA7FBDCDD', datetime.datetime(2014, 6, 30, 0, 0)),
 (7, '134969118', 'adventure-works\\dylan0', "b'Z\\xe1'", 3, 'Research and Development Manager', datetime.date(1987, 2, 24), 'M', 'M', datetime.date(2009, 2, 8), True, 61, 50, True, '4F46DECA-EF01-41FD-9829-0ADAB368E431', datetime.datetime(2014, 6, 30, 0, 0)),
 (8, '811994146', 'adventure-works\\diane1', "b'Z\\xe1X'", 4, 'Research and Development Engineer', datetime.date(1986, 6, 5), 'S', 'F', datetime.date(2008, 12, 29), True, 62, 51, True, '31112635-663B-4018-B4A2-A685C0BF48A4', datetime.datetime(2014, 6, 30, 0, 0)),
 (9, '658797903', 'adventure-works\\gigi0', "b'Z\\xe1h'", 4, 'Research and Development Engineer', datetime.date(1979, 1, 21), 'M', 'F', datetime.date(2009, 1, 16), True, 63, 51, True, '50B6CDC6-7570-47EF-9570-48A64B5F2ECF', datetime.datetime(2014, 6, 30, 0, 0)),
 (10, '879342154', 'adventure-works\\michael6', "b'Z\\xe1x'", 4, 'Research and Development Manager', datetime.date(1984, 11, 30), 'M', 'M', datetime.date(2009, 5, 3), True, 16, 64, True, 'EAA43680-5571-40CB-AB1A-3BF68F04459E', datetime.datetime(2014, 6, 30, 0, 0))]

In [70]:
data = pd.read_sql(query, cnxn)

In [71]:
data

,BusinessEntityID,NationalIDNumber,LoginID,OrganizationNode,OrganizationLevel,JobTitle,BirthDate,MaritalStatus,Gender,HireDate,SalariedFlag,VacationHours,SickLeaveHours,CurrentFlag,rowguid,ModifiedDate
0,1,295847284,adventure-works\ken0,None,NaN,Chief Executive Officer,1969-01-29,S,M,2009-01-14,True,99,69,True,F01251E5-96A3-448D-981E-0F99D789110D,2014-06-30
1,2,245797967,adventure-works\terri0,b'X',1.0,Vice President of Engineering,1971-08-01,S,F,2008-01-31,True,1,20,True,45E8F437-670D-4409-93CB-F9424A40D6EE,2014-06-30
2,3,509647174,adventure-works\roberto0,b'Z\xc0',2.0,Engineering Manager,1974-11-12,M,M,2007-11-11,True,2,21,True,9BBBFB2C-EFBB-4217-9AB7-F97689328841,2014-06-30
3,4,112457891,adventure-works\rob0,b'Z\xd6',3.0,Senior Tool Designer,1974-12-23,S,M,2007-12-05,False,48,80,True,59747955-87B8-443F-8ED4-F8AD3AFDF3A9,2014-06-30
4,5,695256908,adventure-works\gail0,b'Z\xda',3.0,Design Engineer,1952-09-27,M,F,2008-01-06,True,5,22,True,EC84AE09-F9B8-4A15-B4A9-6CCBAB919B08,2014-06-30
5,6,998320692,adventure-works\jossef0,b'Z\xde',3.0,Design Engineer,1959-03-11,M,M,2008-01-24,True,6,23,True,E39056F1-9CD5-478D-8945-14ACA7FBDCDD,2014-06-30
6,7,134969118,adventure-works\dylan0,b'Z\xe1',3.0,Research and Development Manager,1987-02-24,M,M,2009-02-08,True,61,50,True,4F46DECA-EF01-41FD-9829-0ADAB368E431,2014-06-30
7,8,811994146,adventure-works\diane1,b'Z\xe1X',4.0,Research and Development Engineer,1986-06-05,S,F,2008-12-29,True,62,51,True,31112635-663B-4018-B4A2-A685C0BF48A4,2014-06-30
8,9,658797903,adventure-works\gigi0,b'Z\xe1h',4.0,Research and Development Engineer,1979-01-21,M,F,2009-01-16,True,63,51,True,50B6CDC6-7570-47EF-9570-48A64B5F2ECF,2014-06-30
9,10,879342154,adventure-works\michael6,b'Z\xe1x',4.0,Research and Development Manager,1984-11-30,M,M,2009-05-03,True,16,64,True,EAA43680-5571-40CB-AB1A-3BF68F04459E,2014-06-30

In [72]:
from sqlalchemy import create_engine

In [73]:
def creator():
    return pyodbc.connect(cnxn_str)

In [74]:
engine = create_engine("mssql+pyodbc://", creator=creator)

In [78]:
connection=engine.connect()

In [79]:
df= pd.read_sql_table('HumanResources.Employee', con=connection)

ValueError: Table HumanResources.Employee not found

In [85]:
html_url= "https://en.wikipedia.org/wiki/List_of_Bollywood_films_of_2020"

In [86]:
table= pd.read_html(html_url)

In [87]:
len(table)

14

In [92]:
t=table[13]

In [93]:
t.head()

           0                                                  1
0  Caribbean  Antigua and Barbuda Aruba Bahamas Barbados Cub...
1    Central     Costa Rica Guatemala Honduras Nicaragua Panama
2   Northern              Canada Greenland Mexico United States

In [94]:
import requests

In [95]:
html_url2= "https://en.wikipedia.org/wiki/The_Simpsons"

In [97]:
r=requests.get(html_url2)
print(r.status_code)

200

In [98]:
wiki_tables=pd.read_html(r.text,header = 0)

In [99]:
len(wiki_tables)

31

In [105]:
simpsons = wiki_tables[1]

In [106]:
simpsons.head()

,Season,Season.1,No. ofepisodes,Originally aired,Originally aired.1,Originally aired.2,Viewership,Viewership.1,Viewership.2
0,Season,Season,No. ofepisodes,Season premiere,Season finale,Time slot (ET),Avg. viewers(in millions),Most watched episode,Most watched episode
1,Season,Season,No. ofepisodes,Season premiere,Season finale,Time slot (ET),Avg. viewers(in millions),Viewers(millions),Episode title
2,1,1989–90,13,"December 17, 1989","May 13, 1990",Sunday 8:30 pm,27.8,33.5,"""Life on the Fast Lane"""
3,2,1990–91,22,"October 11, 1990","July 11, 1991",Thursday 8:00 pm,24.4,33.6,"""Bart Gets an F"""
4,3,1991–92,24,"September 19, 1991","August 27, 1992",Thursday 8:00 pm,21.8,25.5,"""Colonel Homer"""

In [107]:
#way to write the tabular content into csv file
simpsons.to_csv('simpsons.csv')

In [109]:
#reading the excel file
#one can also use read_excel() in place of ExcelFile()
b=pd.ExcelFile("6304 Module 5 Data Sets.xlsx")

In [110]:
excel_file

In [112]:
#printing the sheet names present in the above excel workbook
excel_file.sheet_names

['Restaurant',
 'Warehouse Cost',
 'MPG',
 'Child Abuse with Binaries',
 'Child Abuse with Binaries 2',
 'House Appraisals']

In [115]:
#extracting data from a particular sheet of excel
MPG = excel_file.parse('MPG')

In [116]:
MPG.head()

    MPG  Horsepower  Weight
0  43.1          48    1985
1  19.9         110    3365
2  19.2         105    3535
3  17.7         165    3445
4  18.1         139    3205

In [120]:
#used for writing the content of mpg sheet to another excel file called mpg2.xlsx.
#note- index= None helps in not having any index column in the newly written excel file
MPG.to_excel('mpg2.xlsx',index=None)

In [121]:
#startrow lets you mention the no of rows to skip for wiritng the content
#startcol lets you mention the no of columns to skip for wiritng the content

MPG.to_excel('mpg3.xlsx',
             index=None,
            startrow=1,
            startcol=2)